{"Retrieve": "This Operator can access stored information in the data list and load them into the Process.",
           "Select Attributes": "This Operator selects a subset of Attributes of an ExampleSet and removes the other Attributes.",
           "Select Examples": "This operator selects which examples (i.e. rows) of an ExampleSet should be kept and which examples should be removed. Examples within the specified index range are kept, remaining examples are removed.",
           "Normalize": "This operator normalizes the attribute values of the selected attributes.",
           "Discretize by Binning": "This operator discretizes the selected numerical attributes into user-specified number of bins. Bins of equal range are automatically generated, the number of the values in different bins may vary.",
           "Discretize by User Specification": "This operator discretizes the selected numerical attributes into user-specified classes. The selected numerical attributeswill be changed to nominal attributes.",
           "Remove Missing Values": "This operator will remove examples which contain missing value.",
           "Replace Missing Values": "This Operator replaces missing values in Examples of selected Attributes by a specified replacement.",
           "Remove Duplicates": "This operator removes duplicate examples from an ExampleSet by comparing all examples with each other on the basis of the specified attributes. Two examples are considered duplicate if the selected attributes have the same values in them.",
           "Principal Component Analysis": "This operator performs a Principal Component Analysis (PCA) using the covariance matrix. The user can specify the amount of variance to cover in the original data while retaining the best number of principal components. The user can also specify manually the number of principal components.",
           "Feature Selection": "Select features according to the k highest scores",
           "Decision Trees": "This Operator generates a decision tree model, which is used for classification.",
           "Neural Network Models": "This operator learns a model by means of a feed-forward neural network trained by a back propagation algorithm (multi-layer perceptron). This operator cannot handle polynominal attributes.",
           "K-means": "This operator performs clustering using the k-means algorithm. Clustering is concerned with grouping objects together that are similar to each other and dissimilar to the objects belonging to other clusters.",
           "Correlation Matrix": "This operator determines correlation between all attributes.",
           "Exponential Smoothing": "This operator use a simple exponential smoothing algorithm to analyse time series",
           "Apply Model": "This operator applies a model on an ExampleSet.",
           "Result": "This operator shows the results of other Operators"}